heatSolverFEniCSx_OpenFOAM/caseB/fluid/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    topWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    leftWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    rightWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    bottomWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    fluid_to_solid
    {   
        type            fixedFluxPressure;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
